// Завдання 6: Функція приймає деструктуризований масив чисел де буду перший елемент та масив всіх інших.
// За допомогою циклу for переберіть масив, знайдіть мінімальне та максимальне значення. Результат виведіть на консоль.
function findMinMax([firstElement, ...restElements]) {
  // Ініціалізуємо змінні для мінімального та максимального значень, задаємо їм перше значення масиву

  let Min = restElements[0];
  let Max = restElements[0];

  for (let n in restElements) {
    if (Min > restElements[n]) {
      Min = restElements[n];
    } else if (Max < restElements[n]) {
      Max = restElements[n];
    }
    return Min, Max;
  }

  // Перебираємо масив починаючи з другого елементу
  // Перевіряємо, чи поточний елемент менший за мінімальне значення
  // Якщо так, оновлюємо мінімальне значення
  // Перевіряємо, чи поточний елемент більший за максимальне значення
  // Якщо так, оновлюємо максимальне значення
  // Виводимо мінімальне та максимальне значення
  console.log(Min, Max);
}

console.log("Завдання 6 ====================================");
console.log(findMinMax([5, 2, 8, 1, 9, 3])); // Виведе Min: 1 Max: 9

// Завдання 10: Створити функцію, яка приймає масив чисел як аргумент.
function swapMinMax(array) {
  // Ініціалізуємо дві змінні (max і min) з першим елементом масиву. Ці змінні будуть використовуватися для зберігання максимального та мінімального значень в масиві.
  let max = array[0];
  let min = array[0];
  // Ініціалізуємо дві змінні (maxIndex і minIndex) з нульового значення. Ці змінні будуть використовуватися для зберігання індексів максимального та мінімального значень в масиві.
  let maxIndex = 0;
  let minIndex = 0;
  // Використовуємо цикл for для ітерації по масиву. Починаємо з першого елемента (i = 0) і продовжуємо до останнього елемента масиву (i < array.length).
  for (let i = 0; i < array.length; i++) {
    if (array[i] > max) {
      max = array[i];
      maxIndex = i;
    } else if (array[i] < min) {
      min = array[i];
      minIndex = i;
    }
  }

  [array[maxIndex], array[minIndex]] = [array[minIndex], array[maxIndex]];

  // Умова if перевіряє, чи є поточний елемент масиву більшим за поточне максимальне значення. Якщо це так, оновлюємо max з поточним елементом масиву та maxIndex з поточним індексом.

  // Умова else if перевіряє, чи є поточний елемент масиву меншим за поточне мінімальне значення. Якщо це так, оновлюємо min з поточним елементом масиву та minIndex з поточним індексом.
  // Застосовуємо деструктуризацію масиву для обміну місцями мінімального та максимального значення в масиві.
  // Функція повертає масив, в якому мінімальне та максимальне значення обміняні місцями.
  return array;
}

console.log("Завдання 10 ====================================");
// Виводимо в консоль результат виклику функції swapMinMax з масивом [1, 2, 3, 4, 5] як аргументом. Очікуємо бачити [5, 2, 3, 4, 1], оскільки максимальне та мінімальне значення обміняні місцями.
console.log(swapMinMax([1, 2, 3, 4, 5]));
